### Importar

In [ ]:
import pandas as pd

Primary structures: series and dataframes.
**dataframe**: varias columnas (pueden tener valores de diferentes tipos)
**series**: sólo tiene una columna

### Convert data structures to df

In [ ]:
pd.DataFrame(nombredelalista/set/diccionario,otros parámetros)

Otros parámetros:

In [ ]:
columns = podemos ponerle nombre directamente si es una serie o poner una lista con los heads de las columnas y pasarlo como este parámetro
orient = para los diccionarios

### Math functions

In [ ]:
df['colmna'].max/min/sum/avg

## Tarea en clase

In [2]:
import numpy as np

In [1]:
import pandas as pd

**create dataframe**

In [6]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
s[1]

3.0

**cambiar los index por letras, por ejemplo**

In [8]:
s = pd.Series([1, 3, 5, np.nan, 6, 8],index=['a','b','c','d','e','f'])
s

a    1.0
b    3.0
c    5.0
d    NaN
e    6.0
f    8.0
dtype: float64

**utilizar np.arrange para indexar**

In [12]:
s = pd.Series([1, 3, 5, np.nan, 6, 8],index=np.arange(2,14,2))
s

2     1.0
4     3.0
6     5.0
8     NaN
10    6.0
12    8.0
dtype: float64

**create daframe**

Sin nombres de columnas

In [13]:
df = pd.DataFrame(np.random.random((10,5)))
df

          0         1         2         3         4
0  0.083677  0.949718  0.893550  0.380817  0.863137
1  0.692623  0.942636  0.404375  0.181127  0.279295
2  0.867841  0.067827  0.139755  0.453248  0.474208
3  0.692850  0.160962  0.943514  0.204405  0.514416
4  0.826629  0.662060  0.729235  0.937583  0.805643
5  0.337495  0.163248  0.116612  0.093087  0.126830
6  0.269691  0.133007  0.641275  0.935243  0.432010
7  0.545536  0.122786  0.959987  0.110360  0.899386
8  0.595715  0.086171  0.902472  0.955302  0.994268
9  0.806737  0.462684  0.804559  0.379198  0.482842

Con nombres de columnas:

In [14]:
colnames = ['Col1','Col2','Col3','Col4','Col5']
df = pd.DataFrame(np.random.random((10,5)),columns=colnames)
df

       Col1      Col2      Col3      Col4      Col5
0  0.202706  0.110726  0.092765  0.499111  0.903827
1  0.379537  0.456629  0.015106  0.417372  0.979449
2  0.764403  0.667702  0.307365  0.076516  0.263361
3  0.812013  0.366356  0.222118  0.399112  0.738724
4  0.328183  0.274546  0.059975  0.957172  0.633332
5  0.135391  0.569372  0.225033  0.234285  0.222458
6  0.794252  0.430950  0.835923  0.921527  0.015098
7  0.814239  0.989310  0.294298  0.599304  0.988680
8  0.254688  0.931269  0.126713  0.230619  0.743058
9  0.398962  0.610530  0.512651  0.244549  0.945320

Seleccionar columnas:

In [15]:
df['Col1']

0    0.202706
1    0.379537
2    0.764403
3    0.812013
4    0.328183
5    0.135391
6    0.794252
7    0.814239
8    0.254688
9    0.398962
Name: Col1, dtype: float64

In [18]:
df[['Col1','Col2','Col3']]

       Col1      Col2      Col3
0  0.202706  0.110726  0.092765
1  0.379537  0.456629  0.015106
2  0.764403  0.667702  0.307365
3  0.812013  0.366356  0.222118
4  0.328183  0.274546  0.059975
5  0.135391  0.569372  0.225033
6  0.794252  0.430950  0.835923
7  0.814239  0.989310  0.294298
8  0.254688  0.931269  0.126713
9  0.398962  0.610530  0.512651

**Crear fechas dentro de un rango para aplicarlas como índices**

In [21]:
df.index = pd.date_range('2019/01/30',periods=df.shape[0])
df

                Col1      Col2      Col3      Col4      Col5
2019-01-30  0.202706  0.110726  0.092765  0.499111  0.903827
2019-01-31  0.379537  0.456629  0.015106  0.417372  0.979449
2019-02-01  0.764403  0.667702  0.307365  0.076516  0.263361
2019-02-02  0.812013  0.366356  0.222118  0.399112  0.738724
2019-02-03  0.328183  0.274546  0.059975  0.957172  0.633332
2019-02-04  0.135391  0.569372  0.225033  0.234285  0.222458
2019-02-05  0.794252  0.430950  0.835923  0.921527  0.015098
2019-02-06  0.814239  0.989310  0.294298  0.599304  0.988680
2019-02-07  0.254688  0.931269  0.126713  0.230619  0.743058
2019-02-08  0.398962  0.610530  0.512651  0.244549  0.945320

**Convertir listas o diccionarios:**

In [29]:
lst = [1827421347,832759527,892137508,98231759,8713576]
price_df = pd.DataFrame(lst,columns=['Saleprice'])
price_df

    Saleprice
0  1827421347
1   832759527
2   892137508
3    98231759
4     8713576

In [27]:
price_df[0]

KeyError: 0

In [31]:
lst_lst = [[8450, 'CollgCr', 2003, 7, 208500],
          [9600, 'Veenker', 1976, 6, 181500],
          [11250, 'CollgCr', 2001, 7, 223500],
          [9550, 'Crawfor', 1915, 7, 140000],
          [14260, 'NoRidge', 2000, 8, 250000],
          [14115, 'Mitchel', 1993, 5, 143000],
          [10084, 'Somerst', 2004, 8, 307000],
          [10382, 'NWAmes', 1973, 7, 200000],
          [6120, 'OldTown', 1931, 7, 129900],
          [7420, 'BrkSide', 1939, 5, 118000]]

In [32]:
colnames = ['Lot size','Neighborhood','Year Built', 'Quality', 'Sale Price']
lst_df = pd.DataFrame(lst_lst, columns=colnames)
lst_df

   Lot size Neighborhood  Year Built  Quality  Sale Price
0      8450      CollgCr        2003        7      208500
1      9600      Veenker        1976        6      181500
2     11250      CollgCr        2001        7      223500
3      9550      Crawfor        1915        7      140000
4     14260      NoRidge        2000        8      250000
5     14115      Mitchel        1993        5      143000
6     10084      Somerst        2004        8      307000
7     10382       NWAmes        1973        7      200000
8      6120      OldTown        1931        7      129900
9      7420      BrkSide        1939        5      118000

**Convertir diccionario:**

In [33]:
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
             'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
             'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
             'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
             'James House': [11250, 'CollgCr', 2001, 7, 223500],
             'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
             'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
             'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
             'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
             'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [34]:
dict_df = pd.DataFrame(house_dict)
dict_df

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [35]:
dict_df = pd.DataFrame(house_dict).T
dict_df

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

La puedo transponer mediante los siguientes dos métodos:

In [36]:
dict_df = pd.DataFrame(house_dict).transpose()
dict_df

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [38]:
dict_df = pd.DataFrame(house_dict).transpose()
dict_df

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

Le puedo poner los nombres de las columnas que yo quiera como antes:

In [48]:
dict_df.columns=colnames
dict_df

                Lot size Neighborhood Year Built Quality Sale Price
Baker House         7420      BrkSide       1939       5     118000
Beazley House      14115      Mitchel       1993       5     143000
Dominguez House    14260      NoRidge       2000       8     250000
Hamilton House      6120      OldTown       1931       7     129900
James House        11250      CollgCr       2001       7     223500
Martinez House      9600      Veenker       1976       6     181500
Roberts House       9550      Crawfor       1915       7     140000
Smith House         8450      CollgCr       2003       7     208500
Snyder House       10084      Somerst       2004       8     307000
Zuckerman House    10382       NWAmes       1973       7     200000

También se pueden crear dataframes a partir de un diccionario de la siguiente manera:

In [40]:
dict_df_2 = pd.DataFrame.from_dict(house_dict,orient='index')
dict_df_2

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [50]:
dict_df_2.columns=colnames
dict_df_2

                 Lot size Neighborhood  Year Built  Quality  Sale Price
Baker House          7420      BrkSide        1939        5      118000
Beazley House       14115      Mitchel        1993        5      143000
Dominguez House     14260      NoRidge        2000        8      250000
Hamilton House       6120      OldTown        1931        7      129900
James House         11250      CollgCr        2001        7      223500
Martinez House       9600      Veenker        1976        6      181500
Roberts House        9550      Crawfor        1915        7      140000
Smith House          8450      CollgCr        2003        7      208500
Snyder House        10084      Somerst        2004        8      307000
Zuckerman House     10382       NWAmes        1973        7      200000

### Parámetros útiles para los DF

In [42]:
dict_df_2.head(2)

                   0        1     2  3       4
Baker House     7420  BrkSide  1939  5  118000
Beazley House  14115  Mitchel  1993  5  143000

In [43]:
dict_df_2.tail(2)

                     0        1     2  3       4
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [44]:
dict_df_2.shape

(10, 5)

In [46]:
dict_df_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Baker House to Zuckerman House
Data columns (total 5 columns):
0    10 non-null int64
1    10 non-null object
2    10 non-null int64
3    10 non-null int64
4    10 non-null int64
dtypes: int64(4), object(1)
memory usage: 480.0+ bytes

Contar cuantas ocurrencias de cada valor:

In [51]:
dict_df_2['Quality'].value_counts(dropna = False)

7    5
8    2
5    2
6    1
Name: Quality, dtype: int64

Para mirar en todas las columnas:

In [ ]:
dict_df_2.apply(pd.Series.value_counts)

**Seleccionar parte de una serie o de un df. 
Se puede jugar con los índices y con loc o iloc.**

In [53]:
s.iloc[0]

1.0

**loc funciona con labels:**

In [55]:
dict_df_2.loc['Hamilton House']

Lot size           6120
Neighborhood    OldTown
Year Built         1931
Quality               7
Sale Price       129900
Name: Hamilton House, dtype: object

Me da toda la info sobre Hamilton House

In [56]:
df.loc['2019/01/30']

Col1    0.202706
Col2    0.110726
Col3    0.092765
Col4    0.499111
Col5    0.903827
Name: 2019-01-30 00:00:00, dtype: float64

In [57]:
df.iloc[0,0:]

Col1    0.202706
Col2    0.110726
Col3    0.092765
Col4    0.499111
Col5    0.903827
Name: 2019-01-30 00:00:00, dtype: float64

In [58]:
df.iloc[0,0]

0.20270562430872507

In [59]:
df.iloc[:2,:2]

                Col1      Col2
2019-01-30  0.202706  0.110726
2019-01-31  0.379537  0.456629

## Operaciones matemáticas

In [60]:
dict_df_2['Sale Price'].sum()

1901400

In [62]:
dict_df_2['Sale Price'].min()

118000

In [63]:
dict_df_2['Sale Price'].max()

307000

In [64]:
dict_df_2['Sale Price'].mean()

190140.0

In [67]:
dict_df_2['Sale Price'].std()

60028.293329062755

In [68]:
dict_df_2['Sale Price'].median()

190750.0